faridfma/STM32H7_RFreader/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

///* Private defines -----------------------------------------------------------*/
//#define B1_Pin GPIO_PIN_13
//#define B1_GPIO_Port GPIOC
//#define MCO_Pin GPIO_PIN_0
//#define MCO_GPIO_Port GPIOH
//#define RMII_MDC_Pin GPIO_PIN_1
//#define RMII_MDC_GPIO_Port GPIOC
//#define RMII_REF_CLK_Pin GPIO_PIN_1
//#define RMII_REF_CLK_GPIO_Port GPIOA
//#define RMII_MDIO_Pin GPIO_PIN_2
//#define RMII_MDIO_GPIO_Port GPIOA
//#define RMII_CRS_DV_Pin GPIO_PIN_7
//#define RMII_CRS_DV_GPIO_Port GPIOA
//#define RMII_RXD0_Pin GPIO_PIN_4
//#define RMII_RXD0_GPIO_Port GPIOC
//#define RMII_RXD1_Pin GPIO_PIN_5
//#define RMII_RXD1_GPIO_Port GPIOC
//#define LED_GREEN_Pin GPIO_PIN_0
//#define LED_GREEN_GPIO_Port GPIOB
//#define RMII_TXD1_Pin GPIO_PIN_13
//#define RMII_TXD1_GPIO_Port GPIOB
//#define LED_RED_Pin GPIO_PIN_14
//#define LED_RED_GPIO_Port GPIOB
//#define STLK_VCP_RX_Pin GPIO_PIN_8
//#define STLK_VCP_RX_GPIO_Port GPIOD
//#define STLK_VCP_TX_Pin GPIO_PIN_9
//#define STLK_VCP_TX_GPIO_Port GPIOD
//#define USB_FS_PWR_EN_Pin GPIO_PIN_10
//#define USB_FS_PWR_EN_GPIO_Port GPIOD
//#define USB_FS_OVCR_Pin GPIO_PIN_7
//#define USB_FS_OVCR_GPIO_Port GPIOG
//#define USB_FS_VBUS_Pin GPIO_PIN_9
//#define USB_FS_VBUS_GPIO_Port GPIOA
//#define USB_FS_ID_Pin GPIO_PIN_10
//#define USB_FS_ID_GPIO_Port GPIOA
//#define SWDIO_Pin GPIO_PIN_13
//#define SWDIO_GPIO_Port GPIOA
//#define SWCLK_Pin GPIO_PIN_14
//#define SWCLK_GPIO_Port GPIOA
//#define RMII_TX_EN_Pin GPIO_PIN_11
//#define RMII_TX_EN_GPIO_Port GPIOG
//#define RMII_TXD0_Pin GPIO_PIN_13
//#define RMII_TXD0_GPIO_Port GPIOG
//#define SWO_Pin GPIO_PIN_3
//#define SWO_GPIO_Port GPIOB
//#define LED_YELLOW_Pin GPIO_PIN_1
//#define LED_YELLOW_GPIO_Port GPIOE
//
//#define GREEN_LED2_CNTRL_Pin GPIO_PIN_8
//#define GREEN_LED2_CNTRL_GPIO_Port GPIOC



/* Private defines -----------------------------------------------------------*/
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOH
#define RMII_MDC_Pin GPIO_PIN_1
#define RMII_MDC_GPIO_Port GPIOC
#define RMII_REF_CLK_Pin GPIO_PIN_1
#define RMII_REF_CLK_GPIO_Port GPIOA
#define RMII_MDIO_Pin GPIO_PIN_2
#define RMII_MDIO_GPIO_Port GPIOA
#define RMII_CRS_DV_Pin GPIO_PIN_7
#define RMII_CRS_DV_GPIO_Port GPIOA
#define RMII_RXD0_Pin GPIO_PIN_4
#define RMII_RXD0_GPIO_Port GPIOC
#define RMII_RXD1_Pin GPIO_PIN_5
#define RMII_RXD1_GPIO_Port GPIOC
#define RMII_TXD1_Pin GPIO_PIN_13
#define RMII_TXD1_GPIO_Port GPIOB
#define STLK_VCP_RX_Pin GPIO_PIN_8
#define STLK_VCP_RX_GPIO_Port GPIOD
#define STLK_VCP_TX_Pin GPIO_PIN_9
#define STLK_VCP_TX_GPIO_Port GPIOD
#define SWDIO_Pin GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define SWCLK_Pin GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA
#define RMII_TX_EN_Pin GPIO_PIN_11
#define RMII_TX_EN_GPIO_Port GPIOG
#define RMII_TXD0_Pin GPIO_PIN_13
#define RMII_TXD0_GPIO_Port GPIOG
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB

#define EN_RL3_MCU_Pin GPIO_PIN_2
#define EN_RL3_MCU_GPIO_Port GPIOE
#define EN_RL4_MCU_Pin GPIO_PIN_3
#define EN_RL4_MCU_GPIO_Port GPIOE
#define EN_RL5_MCU_Pin GPIO_PIN_4
#define EN_RL5_MCU_GPIO_Port GPIOE
#define EN_RL6_MCU_Pin GPIO_PIN_5
#define EN_RL6_MCU_GPIO_Port GPIOE
#define OPTO1_MCU_Pin GPIO_PIN_6
#define OPTO1_MCU_GPIO_Port GPIOE
#define MUX_SELECT_Pin GPIO_PIN_13
#define MUX_SELECT_GPIO_Port GPIOC
#define OPTO2_MCU_Pin GPIO_PIN_2
#define OPTO2_MCU_GPIO_Port GPIOF
#define OPTO3_MCU_Pin GPIO_PIN_3
#define OPTO3_MCU_GPIO_Port GPIOF
#define OPTO4_MCU_Pin GPIO_PIN_4
#define OPTO4_MCU_GPIO_Port GPIOF
#define EN_DCDC1_MCU_Pin GPIO_PIN_5
#define EN_DCDC1_MCU_GPIO_Port GPIOF
#define EN_DCDC2_MCU_Pin GPIO_PIN_6
#define EN_DCDC2_MCU_GPIO_Port GPIOF
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOH
#define TAG_READER_RESETn_Pin GPIO_PIN_0
#define TAG_READER_RESETn_GPIO_Port GPIOC
#define RMII_MDC_Pin GPIO_PIN_1
#define RMII_MDC_GPIO_Port GPIOC
#define RMII_REF_CLK_Pin GPIO_PIN_1
#define RMII_REF_CLK_GPIO_Port GPIOA
#define RMII_MDIO_Pin GPIO_PIN_2
#define RMII_MDIO_GPIO_Port GPIOA
#define RMII_CRS_DV_Pin GPIO_PIN_7
#define RMII_CRS_DV_GPIO_Port GPIOA
#define RMII_RXD0_Pin GPIO_PIN_4
#define RMII_RXD0_GPIO_Port GPIOC
#define RMII_RXD1_Pin GPIO_PIN_5
#define RMII_RXD1_GPIO_Port GPIOC
#define RF_SW_CNTRL_Pin GPIO_PIN_0
#define RF_SW_CNTRL_GPIO_Port GPIOB
#define RMII_TXD1_Pin GPIO_PIN_13
#define RMII_TXD1_GPIO_Port GPIOB
#define LoRa_RESETn_Pin GPIO_PIN_8
#define LoRa_RESETn_GPIO_Port GPIOD
#define RED_LED_ALRM_Pin GPIO_PIN_5
#define RED_LED_ALRM_GPIO_Port GPIOG
#define GREEN_LED1_CNTRL_Pin GPIO_PIN_8
#define GREEN_LED1_CNTRL_GPIO_Port GPIOA
#define GREEN_LED2_CNTRL_Pin GPIO_PIN_8
#define GREEN_LED2_CNTRL_GPIO_Port GPIOC
#define SWDIO_Pin GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define SWCLK_Pin GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA
#define RMII_TX_EN_Pin GPIO_PIN_11
#define RMII_TX_EN_GPIO_Port GPIOG
#define RMII_TXD0_Pin GPIO_PIN_13
#define RMII_TXD0_GPIO_Port GPIOG
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define EN_RL1_MCU_Pin GPIO_PIN_0
#define EN_RL1_MCU_GPIO_Port GPIOE
#define EN_RL2_MCU_Pin GPIO_PIN_1
#define EN_RL2_MCU_GPIO_Port GPIOE
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
